<template>
  <div >
    <pre style="line-height:2">
      场景
      1.对组件模版进行封装，完成常规的数据的“增删查改”。
      2.统一前端展示的风格，包括查询条件、表格展示、分页等等
      3.开发人员通过配置，以及数据填充，完成页面的自动渲染
      4.开发特殊场景的模版组件，完成数据展示，通过设置不同的主题来展示不同的效果
      5.通过插槽等方式，完成功能的自定义以及信息展示

      目的
      1.减少开发人员对css与html代码的依赖，直接通过配置的方式完成常规的增删查改的功能
      2.增加开发的效率，更加专注于业务逻辑的开发

      设计思路与流程
      Components -> JSON Description -> Runtime Renderer -> Page

      优点

      可以通过配置的方式，简单快速的完成常规的curd功能开发

      缺点

      1.无法预期未来可能出现的所以场景，业务组件的抽象画是一个难题
      2.配置点相对较多，特别是表单的各种数据项比较复杂，例如如输入框、下拉选项、复选、单选等等

      综合解决思路

      简单常规的使用配置的方式完成，复杂定制化的功能使用手写的方式解决处理
    </pre>
  </div>
</template>
<script>
export default {
  data () {
    return {}
  },
  created () {

  },
  mounted () {
  },
  methods: {
  }
}
</script>
